[
  {
    "jobTitle": "React Native Developer",
    "jobComName": "Tracktile",
    "jobURL": "https://jobrack.eu/jobs/react-native-developer-3",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/3072",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6537b68f3bd9d.jpg",
    "companyDescription": "Tracktile is seeking a seasoned Fullstack Developer with comprehensive expertise in TypeScript, NodeJS, AWS, and React Native."
  },
  {
    "jobTitle": "Marketing Project Manager",
    "jobComName": "Incubated",
    "jobURL": "https://jobrack.eu/jobs/marketing-project-manager",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/3194",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/66265937c444b.jpg",
    "companyDescription": "At Incubated, we provide a range of resources to support aspiring businesses, including office space, telecommunications solutions, customer services, marketing assistance, website development, and investment opportunities. Our goal is to help build brands from the ground up, providing the necessary tools and support for success."
  },
  {
    "jobTitle": "People Manager",
    "jobComName": "Trialfacts",
    "jobURL": "https://jobrack.eu/jobs/people-manager",
    "jobDescription": "Attracting & Retaining Exceptional Talent: Recognizing the pivotal role people play in our company's success, we are committed to a mission of attracting and retaining exceptional talent. Your leadership will be instrumental in refining our strategies to achieve this objective, placing a strong emphasis on high retention rates and the ongoing maintenance of an outstanding eNPS score.\nChampioning Learning & Development: Embracing the core value of 'Continuous Improvement,' we are dedicated to establishing a robust Learning and Development process. This initiative involves implementing continuous company-wide training and personalised development plans. Your leadership is key to fostering an environment where both our team and the company can thrive through continual growth.\nElevating Total Rewards: Taking our Total Rewards approach to new heights, we seek ongoing innovative solutions that continuously set us apart. Your task is to explore unique and unconventional approaches. Additionally, you'll be responsible for constructing a job levelling system that not only facilitates professional growth but also paves the way for managerial and contributor advancement within Trialfacts.\nOptimising Financial Operations: Your team will oversee the financial administration of the business, encompassing tasks such as managing accounts receivable, payroll, and credits. Your role will involve enhancing and streamlining these processes to guarantee timely payments and receipts.",
    "companyURL": "https://jobrack.eu/employers/3229",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/665976f85904e.jpg",
    "companyDescription": "Health is a universal right, yet disease strikes indiscriminately. At Trialfacts we’re on a mission to right this injustice and provide good health for all by advancing medical research. We're on the lookout for a People Manager with experience in learning & development, employee engagement and talent acquisition, as well as a knack for financial processes. If you're passionate about making a difference, thrive in a remote work environment, and are driven to innovate, this role is for you."
  },
  {
    "jobTitle": "Graphic / Motion Designer",
    "jobComName": "Native Pet",
    "jobURL": "https://jobrack.eu/jobs/graphic-motion-designer",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/3210",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/66582711c3bdb.jpg",
    "companyDescription": "Hey there,"
  },
  {
    "jobTitle": "Social Media Content Designer",
    "jobComName": "WNOG MEDIA",
    "jobURL": "https://jobrack.eu/jobs/social-media-content-designer-2",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/2960",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/65b6899c53ddf.jpg",
    "companyDescription": "WNOG MEDIA is a digital marketing agency specializing in creating visually appealing and engaging social media content. We help businesses across various industries, including health & wellness, beauty, and real estate, stand out and drive more leads."
  },
  {
    "jobTitle": "Marketing Executive",
    "jobComName": "Property Hub",
    "jobURL": "https://jobrack.eu/jobs/marketing-executive",
    "jobDescription": "Experience with Salesforce and email systems such as Pardot or Active Campaign\nAbility to analyse data, evaluate findings and present the success of your campaigns.\nProperty Sector or investment sales experience.",
    "companyURL": "https://jobrack.eu/employers/3215",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6655c8ea469f5.jpg",
    "companyDescription": "Hi, I'm Caroline from Property Hub."
  },
  {
    "jobTitle": "Paid Ads Specialists (2 Positions Available: Google + Meta)",
    "jobComName": "Flowlane",
    "jobURL": "https://jobrack.eu/jobs/paid-ads-specialists-2-positions-available-google-meta",
    "jobDescription": "Elevating Marketing to Exceptional Heights: We blend analytics with creative strategies to deliver outstanding results.\nAccelerate Success. Magnify Impact: Our integrated approach turns strategic insights into rapid, tangible results.\nLead Boldly. Impact Widely: We create bold, innovative campaigns that empower our clients to dominate their industries.",
    "companyURL": "https://jobrack.eu/employers/3222",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6655684591832.jpg",
    "companyDescription": "About Us:\n\nFlowlane is a pioneering digital marketing agency renowned for its seamless integration of marketing science and creative genius. We specialize in delivering high-impact marketing solutions through a collaborative ecosystem of specialized agencies. Our mission is to blend cutting-edge analytics with transformative creative strategies to drive exceptional outcomes for our clients."
  },
  {
    "jobTitle": "SEO Specialist",
    "jobComName": "Huemor",
    "jobURL": "https://jobrack.eu/jobs/seo-specialist-63",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/2464",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/60ef18ddb15e0.jpg",
    "companyDescription": "Embark on a creative journey with Huemor Designs, where passion and innovation converge to shape remarkable digital experiences."
  },
  {
    "jobTitle": "Marketing Coordinator",
    "jobComName": "O'Rourke Hospitality",
    "jobURL": "https://jobrack.eu/jobs/marketing-coordinator-5",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/3083",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6551eacfeef32.jpg",
    "companyDescription": "We’ve drafted this based on the information we’ve captured from you. If there’s anything that needs adjusting, no worries, simply edit below, comment or we’ll chat through on the onboarding call."
  },
  {
    "jobTitle": "Customer Success Specialist",
    "jobComName": "Pikkii.",
    "jobURL": "https://jobrack.eu/jobs/customer-success-specialist-2",
    "jobDescription": "💰 $1400 - $1800 per month*\n🌴 Full-time & fully remote - work remotely from anywhere you prefer!\n🌟 Opportunities for growth\n🌴 PTO: 20 days per year",
    "companyURL": "https://jobrack.eu/employers/3208",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/664f2115def4c.jpg",
    "companyDescription": "Hi there!"
  },
  {
    "jobTitle": "Marketing Operations and Project Manager",
    "jobComName": "Women's Money Mastery",
    "jobURL": "https://jobrack.eu/jobs/marketing-operations-and-project-manager",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/3025",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/64e4a03a3095c.jpg",
    "companyDescription": ""
  },
  {
    "jobTitle": "Hugarian Speaking SEO & Content Writer",
    "jobComName": "Apps4 Web Media Limited",
    "jobURL": "https://jobrack.eu/jobs/hugarian-speaking-seo-content-writer",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/2723",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/62b156f68e68a.jpg",
    "companyDescription": "Do you want to work in a fast-growing, exciting iGaming company? Are you an experienced iGaming content writer with a knowledge of SEO and fluent in Hungarian? Then this could be the job for you! We are looking to hire an experienced iGaming content writer & SEO to join a vibrant and growing international team."
  },
  {
    "jobTitle": "Operations Manager",
    "jobComName": "Lunderg",
    "jobURL": "https://jobrack.eu/jobs/operations-manager-523",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/3092",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/655e406457c64.jpg",
    "companyDescription": "Cross Innovations is a dynamic company specializing in designing, manufacturing, and distributing premium Durable Medical Equipment (DME) and Home Medical Equipment (HME) products for the Lunderg Brand."
  },
  {
    "jobTitle": "Customer Success Manager - AI & Marketing Automation Agency",
    "jobComName": "Clinic Convert",
    "jobURL": "https://jobrack.eu/jobs/customer-success-manager-ai-marketing-automation-agency",
    "jobDescription": "Oversee the onboarding process for new clients, ensuring a smooth and effective transition to Clinic Convert.\nConduct onboarding and training calls to educate clients on the use and benefits of the GoHighLevel CRM system.\nHelp clients leverage the CRM to maximize their marketing efforts.\nDevelop and update training materials as needed to ensure clients have access to the most current information.",
    "companyURL": "https://jobrack.eu/employers/2946",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/664f2b61b783f.jpg",
    "companyDescription": "Clinic Convert is a leading provider of comprehensive CRM solutions tailored specifically for chiropractic clinics across the UK, with plans to expand into the US. Our platform, powered by GoHighLevel (GHL), helps clinics manage their client relationships effectively, streamline operations, and enhance overall productivity. We are committed to ensuring the success of our clients by providing top-notch support and innovative solutions."
  },
  {
    "jobTitle": "SEO Specialist",
    "jobComName": "Lahav Meida",
    "jobURL": "https://jobrack.eu/jobs/seo-specialist-64",
    "jobDescription": "Stay updated with industry trends, algorithm updates, and best practices in SEO.\nPropose new ideas, strategies, and tactics to improve SEO performance.\nA/B test different elements of SEO campaigns to optimize results.\nRegularly review and refine SEO strategies based on performance data.",
    "companyURL": "https://jobrack.eu/employers/3217",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/664c59ead2bdb.jpg",
    "companyDescription": "Lahav Media is a digital marketing agency headquartered in Boulder, Colorado, boasting over 8 years of industry expertise. Our primary focus is on providing top-notch SEO services tailored for local service companies across the US. Despite being spread across the globe, our team works seamlessly, ensuring we stay updated with the latest advancements to deliver exceptional results for our clients."
  },
  {
    "jobTitle": "Client Manager",
    "jobComName": "LDX Digital",
    "jobURL": "https://jobrack.eu/jobs/client-manager",
    "jobDescription": "2+ years of experience as a client manager\nHighly organized with a mindfulness of deadlines, the ability to manage multiple tasks based on priorities and a strong attention to detail\nIndependent thinker confident in taking ownership of assets and material development, but a team player who enjoys collaboration\nProfessional presence, performs with a sense of urgency and with a client service orientation\nHas confidence to manage upward when required; able to communicate with managers when deadlines will not be met or when issues are foreseeable\nHigh energy, able to effectively operate in fast-paced, growing and evolving environment\nDemonstrated strong work ethic, with a track record of following through on client requests and with high-quality deliverables on schedule\nExceptional written and oral communication and presentations skills\nGreat knowledge of Google Suite (Slides, Docs, Sheets)\nExcellent business communication ability including informal/formal presentation and writing skills; this includes confident public speaking both internally and externally with clients\nAbility to mentor junior staff and delegate accordingly in order to achieve project deadlines\nAbility to communicate with managers when deadlines will not be met\nAbility to devise and articulate solutions to problems on an ongoing basis\nAbility to clearly communicate project updates, scopes and recommendations to clients\nDemonstrated experience with managing client relationships\nBachelor’s Degree in Communications, marketing, business or a related field. Substantial work experience will be considered as a Bachelor’s Degree",
    "companyURL": "https://jobrack.eu/employers/2406",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/65f436ed345c8.jpg",
    "companyDescription": "LDX Digital is a dynamic and innovative Google Ads agency committed to delivering exceptional services and solutions to our clients. Our team is dedicated to fostering strong client relationships and driving business success through personalized service and strategic support. We work fully remotely with our team based all over the globe. We are looking for a motivated and experienced Client Manager to join our team and help us achieve our goals."
  },
  {
    "jobTitle": "Photo Retoucher / Mock Ups",
    "jobComName": "iEnjoy Home",
    "jobURL": "https://jobrack.eu/jobs/photo-retoucher-mock-ups",
    "jobDescription": "Microsoft Office, Adobe CC\nExperienced working in a concept through production environment\nMust speak English and have solid written and verbal communication skills\nAbility to build and maintain good / trust-based relationships with management, peers and staff; has a pleasant and friendly demeanor\nTypes 40+ WPM accurately\nTakes pride and accountability in work product\nWorks quickly with accurate results and an eye for detail\nAbility to use automated information systems / dropbox / MS Office / Phone System\nEnjoys suggesting improvements to company processes and communication techniques\nStrong work ethic / reliable.\nMust be Internet literate.\nFast and confident learner\nWilling to work 6AM - 1PM EST (Florida TIme)",
    "companyURL": "https://jobrack.eu/employers/3216",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/664b903abdbe8.jpg",
    "companyDescription": "Since its inception, ienjoy Home has become one of the fastest growing companies in the bedding industry. Everything we do, everything we make, and everyone we hire needs to reflect how grateful we are for the people who make our business possible."
  },
  {
    "jobTitle": "Executive Assistant",
    "jobComName": "Soberclear",
    "jobURL": "https://jobrack.eu/jobs/executive-assistant-150",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/3207",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/664743fd444a8.jpg",
    "companyDescription": ""
  },
  {
    "jobTitle": "Amazon Brand Manager",
    "jobComName": "Cross Path Capital",
    "jobURL": "https://jobrack.eu/jobs/amazon-brand-manager-8",
    "jobDescription": "Self starter who can execute a vision and deliver results\nProven track record with at least 3 years experience in end-to-end Amazon product management and listing optimization\nPossesses a keen analytical mind capable of translating data into strategic actions\nExpertise in Amazon Seller Central, paired with a mastery in keyword research, competitive analysis, inventory management, and SEO best practices specific to Amazon\nStrong communication and team coordination skills\nOrganized individual who thrives in managing concurrent projects without missing a beat\nDeep understanding of Amazon's operational framework and a preemptive approach to compliance and problem-solving.",
    "companyURL": "https://jobrack.eu/employers/3214",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/66476d2784ac7.jpg",
    "companyDescription": "Cross Path Capital is a successful and growing remote based eCommerce company that has been in business for more than 8 years.  In 2016 we started as resellers out of a garage in Newport Beach, CA and have since grown to a team of 8 selling over $10M of product annually. We sell our products through our 2 main brands - Barnyard Designs (Home Decor), and Seedboy (Gardening) on various channels such as Amazon, Walmart, Wayfair, Shopify, and Faire. "
  },
  {
    "jobTitle": "Multilingual Support Specialist",
    "jobComName": "The Ridge",
    "jobURL": "https://jobrack.eu/jobs/multilingual-support-specialist",
    "jobDescription": "At this time, we offer pay on a bi-weekly basis via  Wise.com for ease of payment.\nStarting 30 days after the working relationship has started, we offer Paid Vacation and Sick time depending on the number of days remaining in the calendar year. These pools of time will be reset at the beginning of each calendar year.",
    "companyURL": "https://jobrack.eu/employers/2768",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6541689f4adf4.jpg",
    "companyDescription": "Ridge crafts products made to last a lifetime through simple, functional designs ready for anything and everything. Our materials are chosen with care and a thoughtful connection to the insights of our growing community - setting our North star as we strive to improve everyday. Together we can do more with less."
  },
  {
    "jobTitle": "Real Estate Executive Admin",
    "jobComName": "Hodge Home team Inc.",
    "jobURL": "https://jobrack.eu/jobs/real-estate-executive-admin",
    "jobDescription": "Manage/Sort & Respond to Emails\nManage CRM\nManage Monthly Drip Campaigns\nCoordinate Client Events\nmonitor Facebook pages for referrals\nCreate Marketing Materials for all New Listings\nManage the Brand Kit (This is the folder of all agents headshots, company logos etc)\nCreate Marketing Materials For weekly email Newsletter\nOrganize and create a Social Media Content Calendar\nMonitor Business Pages for Incoming Messages\nManage Private Team VIP Facebook Group\nCreate Weekly Blogs for All Sites\nIf No Other Social Media Position Exists, Research Youtube Titles Weekly\nthis allows the team to perform quickly and efficiently when filming videos\nBe Available By Zoom 8 hours a day with minutes notice to help with any random tasks\nBe prepared and knowledgeable and help with Social Media Marketing if no other Social Media Marketing position is on the team\nManager Teams Vendor List\nReach out to Past Clients as Teams “Past Client Care Manager”\nManage & Track Down online Reviews from Past clients\nwork with editing team to ensure tasks are completed timely",
    "companyURL": "https://jobrack.eu/employers/2817",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6373f853de09a.jpg",
    "companyDescription": "\n"
  },
  {
    "jobTitle": "Operations Manager",
    "jobComName": "OneRhythm",
    "jobURL": "https://jobrack.eu/jobs/operations-manager-10",
    "jobDescription": "4-5+ years of experience as an Operations Manager, or similar, with a proven track record\nKnowledge of organisational effectiveness and operations management\nExperience with budgeting and forecasting\nFamiliarity with business and financial principles\nMarketing agency industry experience\nExperience using MS Office and G-Suite applications, particularly Excel/Sheets when it comes to budgets and forecasting\nExcellent communication skills\nLeadership ability\nOutstanding organisational skills\nA sense of humour; this is a must! :)",
    "companyURL": "https://jobrack.eu/employers/2658",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/625e6d888d367.jpg",
    "companyDescription": "Click here to watch the video from Ricardo, the CEO of OneRhythm:"
  },
  {
    "jobTitle": "Operations Manager (Potential Future COO)",
    "jobComName": "Entrepreneurs HQ",
    "jobURL": "https://jobrack.eu/jobs/operations-manager-potential-future-coo",
    "jobDescription": "Educated over 100,000 entrepreneurs through our online events, training and coaching programs\nLaunched more than 15 virtual summits, plus countless online workshops, bootcamps and other virtual events\nHosted 400+ speakers and top influencers at our events",
    "companyURL": "https://jobrack.eu/employers/2816",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/636e835857265.jpg",
    "companyDescription": "Operations Manager"
  },
  {
    "jobTitle": "Junior Digital Marketer at Future State Media",
    "jobComName": "Future State Media",
    "jobURL": "https://jobrack.eu/jobs/junior-digital-marketer-at-future-state-media",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/2473",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/610d5e8a63bee.jpg",
    "companyDescription": "Future State Media provides a range of digital marketing services for our clients that work with us. We help them to understand the marketing world and come up with cost effective strategies for them to succeed."
  },
  {
    "jobTitle": "A/B test developer (remote)",
    "jobComName": "Dexter Agency",
    "jobURL": "https://jobrack.eu/jobs/a-b-test-developer-remote",
    "jobDescription": "Google Optimize\nConvert\nClickUp\nSlack",
    "companyURL": "https://jobrack.eu/employers/2815",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/636e11646e2b2.jpg",
    "companyDescription": ""
  },
  {
    "jobTitle": "SEO Specialist",
    "jobComName": "Vinnie Mac",
    "jobURL": "https://jobrack.eu/jobs/seo-specialist-55",
    "jobDescription": "3+ years of experience with SEO and GBP\nExperience with content management systems like WordPress or DudaExperience with tools such as Ahrefs, Local Falcon, Google My Business, Google Search Console, Google Analytics, Google Tag Manager, BrightLocal, SurferSEO, and Jasper\nFunctional understanding of HTML and CSS\nAbility to work with .htaccess, robots.txt, meta tags, and site speed optimization.\nEagerness to stay up to date with the latest Google algorithm updates and the latest local SEO trends\nExperience managing multiple projects and meeting deadlines",
    "companyURL": "https://jobrack.eu/employers/2725",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/62b1e6b01914e.jpg",
    "companyDescription": "Click here to watch the video from Sean, the owner of Vinnie Mac Restoration Marketing:"
  },
  {
    "jobTitle": "SEO Account Manager",
    "jobComName": "WLDM",
    "jobURL": "https://jobrack.eu/jobs/seo-account-manager-2",
    "jobDescription": "3 years minimum as an Account Manager or SEO Manager in a digital marketing agency\nSolid understanding in keyword research, and general SEO processes\nStrong commitment to delivery on time\nStrong commitment to quality assurance\nGreat communication and written skills\nExtremely organised and experienced in documenting and benchmarking campaigns and strategies, incl. task management in Asana or similar project management tool.\nBeing online and available in Slack chats during work hours: Being hyper-responsive is core to remote work.\nThrives on achieving results and being a leader in their space.\nHas exceptional client management skills.",
    "companyURL": "https://jobrack.eu/employers/1153",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/637bbd41cb187.jpg",
    "companyDescription": "About the business"
  },
  {
    "jobTitle": "Back Office Process Manager (former banker is perfect)",
    "jobComName": "Calworth Glenford LLC",
    "jobURL": "https://jobrack.eu/jobs/back-office-process-manager-former-banker-is-perfect",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/2339",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/5fcea36d0e817.jpg",
    "companyDescription": "We are a US-based company in business for 26 years. We sell health products to men, some that help with sex and others with diabetes and other problems."
  },
  {
    "jobTitle": "Advertising Copywriter for Fast Growing FB Ads Agency",
    "jobComName": "Hernan Vazquez Media LLC",
    "jobURL": "https://jobrack.eu/jobs/advertising-copywriter-for-fast-growing-fb-ads-agency",
    "jobDescription": "Writing FB ads copy\nCreating Email sequences\nWriting copies for landing pages\nWriting Webinar copy",
    "companyURL": "https://jobrack.eu/employers/2289",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/5f3be18b9bda1.jpg",
    "companyDescription": "Hello, Advertising Copywriters!\n\nI’m looking for an enthusiastic and motivated Advertising Copywriter with experience creating copies for FB ads, email marketing sequences, landing pages, and direct response marketing."
  },
  {
    "jobTitle": "Project Manager for Shopify SEO Agency",
    "jobComName": "LOGEIX",
    "jobURL": "https://jobrack.eu/jobs/project-manager-for-shopify-seo-agency",
    "jobDescription": "Slack\nGoogle Sheets/Docs (we use a custom project management sheet, and all client work is within Google Drive)",
    "companyURL": "https://jobrack.eu/employers/727",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6256fe4881740.jpg",
    "companyDescription": "We're looking for a project manager to join our SEO agency."
  },
  {
    "jobTitle": "Software Developer (Back-end) 3 Years+",
    "jobComName": "Hey Lady!",
    "jobURL": "https://jobrack.eu/jobs/software-developer-back-end-3-years",
    "jobDescription": "Solid experience as a Developer that writes quality code and minimises technical debt.\n3+ years of full-time experience with Nodejs, React, GraphQL\nExperience working in a remote team environment where you have demonstrated the ability to work independently\nExperience with 3rd party integrations and API calls eg. payment gateway, video platform, chat\nExperience with queries for matching/algorithms\nExperience with data management and dashboards\nA team-oriented attitude & excellent communication skills\nYour own machine that is capable of handling the work and a stable environment to work from",
    "companyURL": "https://jobrack.eu/employers/2665",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6266e45902d87.jpg",
    "companyDescription": "Hey Lady! is an online community solving one of the biggest problems experienced by English learners around the world today - finding someone genuine and reliable to practise speaking with regularly, is really hard!"
  },
  {
    "jobTitle": "UI/UX Designer",
    "jobComName": "Brandetize",
    "jobURL": "https://jobrack.eu/jobs/ui-ux-designer-2",
    "jobDescription": "Bachelor’s degree or higher in Design\n1-3 years of graphic design experience with Ui/Ux experience\nExperience with Adobe Suite - must be proficient in Xd, Photoshop, Illustrator\nSolid understanding of design fundamentals and techniques as it relates to the web and branding\nExperience with CSS, responsive design, and mobile design\nExperience creating and implementing new design systems\nAbility to act as a leader in communicating conceptual ideas and design rationale within a user-centered design process\nExperience working with cross-functional, agile teams\nExcellent communication and interpersonal skills, and the ability to build good working relationships\nExperience using tech hand-off softwares like Zeplin is a plus\nExperience in various page builder programs such as Shopify, Elementor, and Thrive is a plus\nCRO (conversion rate optimization) knowledge a plus\nAfter Effects knowledge a plus",
    "companyURL": "https://jobrack.eu/employers/2813",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/636a8448c8f6b.jpg",
    "companyDescription": "The goal of the UI/UX Designer is to utilize user-centered design principles to produce and lead the creation of high-quality visuals and user workflows, from concept to execution, across a variety of Brandetize’s accounts. You will weave iconography, typography, color, space, and texture together to help users successfully navigate our client’s websites and funnels. You will collaborate with strategists, fellow designers, and developers to refine design systems, create supporting assets that help guide users to various KPI pages, and create innovative, intuitive, and great-looking designs that people benefit from and help aid in marketing goals."
  },
  {
    "jobTitle": "Graphic Designer, Illustrator & Problem-Solver",
    "jobComName": "Lunderg",
    "jobURL": "https://jobrack.eu/jobs/graphic-designer-illustrator-problem-solver",
    "jobDescription": "Senior-level experience (i.e. 4-5 years) of working with brand development with a proven track record of success\nExperience selling your own products on an eCommerce platform, either your own or a 3rd party platform e.g. Amazon, etc.",
    "companyURL": "https://jobrack.eu/employers/2803",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6369048ee1d93.jpg",
    "companyDescription": "Cross Innovations is an eCommerce company that owns the brand Lunderg. They mainly develop OEM products and bring them to market on Amazon.com. From there, they launch them on Walmart.com and Lunderg.com. Their goal is for customers to associate the Lunderg brand with high-quality products and great customer service."
  },
  {
    "jobTitle": "Project Coordinator",
    "jobComName": "TLC Creative",
    "jobURL": "https://jobrack.eu/jobs/project-coordinator-3",
    "jobDescription": "University degree\nA minimum of 3-4 years of relevant work experience\nOperations & project management experience, with the ability to manage many projects at the same time\nKnowledge of project management tools (e.g. Monday.com, Asana)\nExperience managing a team and managing projects\nExcellent organizational skills and the ability to keep track of details\nExcellence at reviewing input and identifying actionable tasks that need to be accomplished\nImpeccable communication, written and spoken English\nAn obsession with getting the details right, you don’t miss a task and can make sure that everything gets done across multiple concurrent projects\nHigh level of computer skills, ability to quickly learn new software\nDedicated work area\nReliable internet (20/20 Mbps minimum)",
    "companyURL": "https://jobrack.eu/employers/2789",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6364c756cdcec.jpg",
    "companyDescription": "Click here to watch a video by Troy and Lori, the founders of TLC Creative Services:"
  },
  {
    "jobTitle": "Executive Assistant",
    "jobComName": "Real Estate Development and Investment Firm",
    "jobURL": "https://jobrack.eu/jobs/executive-assistant-115",
    "jobDescription": "Experience as an Executive Assistant, Project Coordinator or Office Administrator\nKnowledge of G Suite and Microsoft Office (all apps)\nAbility to work around the hours of Eastern Time Zone as specified above",
    "companyURL": "https://jobrack.eu/employers/2804",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6364d56539dbe.jpg",
    "companyDescription": "A fast-growing Real Estate Development and Investment Firm from Ontario, Canada developing landmark buildings and creating attractive investments for their partners is seeking an ambitious and talented individual to meaningfully assist their executive team."
  },
  {
    "jobTitle": "Travel Coordinator",
    "jobComName": "Lawson Luxury Travel",
    "jobURL": "https://jobrack.eu/jobs/travel-coordinator-4",
    "jobDescription": "Previous hospitality experience or travel planning experience in a corporate environment\nA university degree\nExperience with project management software such as Asana or similar\nExperience with Microsoft Excel and Microsoft Word, as well as PDF\nAbility to take ownership of your tasks\nGreat problem-solving skills\nStrong computer skills and the ability to learn new software and programs quickly\nPositive, can-do attitude",
    "companyURL": "https://jobrack.eu/employers/2773",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/633f0995b1095.jpg",
    "companyDescription": "Lawson Luxury Travel was founded by Lawson Rothgeb in order to share her luxury hospitality experience, wide-ranging travel experiences, love of travel planning and high attention to detail with clients to ensure each of their travel experiences is exceptional. The company is a boutique luxury travel consultancy, curating personalised itineraries for discerning clientele around the world."
  },
  {
    "jobTitle": "Senior Full-Stack Developer",
    "jobComName": "Digital Seat Ownership",
    "jobURL": "https://jobrack.eu/jobs/senior-full-stack-developer-4",
    "jobDescription": "Full-stack software development experience\nNode.js, React.js, net core, SQL server, next js and typescript experience\nExperience with Azure DevOps and Github\nDemonstrable interest in blockchain/web3 technology\nTeam leadership and management experience\nA proactive work attitude; you are a driven and motivated self-starter\nGood communication skills and excellent English",
    "companyURL": "https://jobrack.eu/employers/2745",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/63443a47c1e6a.jpg",
    "companyDescription": "DSO is a new sports technology start-up that’s working on reinventing fan ownership and participation in professional sports clubs, by creating the future of digital seats."
  },
  {
    "jobTitle": "Sales Coordinator",
    "jobComName": "Denison Travel",
    "jobURL": "https://jobrack.eu/jobs/sales-coordinator-3",
    "jobDescription": "An almost obsessive attention to detail and organization is a must\nExceptional written and verbal communication skills, including strong proofreading skills\nTalent for multi-tasking and maintaining order while handling many projects\nAn ability to react quickly and positively to feedback and maintain open lines of communication\nThe ability to manage fast-paced work and stressful situations quickly and calmly\nStrong people skills with the confidence to interact with clients and suppliers effectively and professionally\nA commitment to continuous improvement, excellence, and error-free work\nOutstanding customer service skills, discretion, grace, and humor",
    "companyURL": "https://jobrack.eu/employers/2764",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/63641d5f0d4ae.jpg",
    "companyDescription": "The Sales Coordinator will improve the overall client experience by facilitating a consistent baseline of service to our clients. This role serves as primary support staff to the Founder and travel design team and is laser-focused on meeting the needs of our clients and delivering a highly personalized travel experience. This position’s main priorities are quality control, elevating the client experience by ensuring expediency in communication with both clients and suppliers, facilitating a smooth and consistent sales process, and fostering ongoing client relationships."
  },
  {
    "jobTitle": "Client Operations Manager",
    "jobComName": "Insight Matters",
    "jobURL": "https://jobrack.eu/jobs/client-operations-manager",
    "jobDescription": "At least a Bachelor degree – preferably in business\n3+ years’ experience in project management or account management\nNear native level English, both spoken and written\nExperienced in handling multiple clients with conflicting timelines\nExperience with working remotely\nProven interest in accounting and/or finance\nProven understanding of entrepreneurs in e-Commerce and/or Agencies",
    "companyURL": "https://jobrack.eu/employers/2326",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6363fa305fc09.jpg",
    "companyDescription": "About the role:"
  },
  {
    "jobTitle": "Master Copywriter and Funnel Builder",
    "jobComName": "Beach Boss Influencers",
    "jobURL": "https://jobrack.eu/jobs/master-copywriter-and-funnel-builder",
    "jobDescription": "Oversee and provide guidance on social media posts, blogs, and weekly value emails to ensure it’s on brand and direct response driven\nWrite converting sales page and email copy for monthly promotions and paid traffic funnels\nOversee and approve ad copy written by media buyers\nManage sales page and email creation process, dedicating tasks to our graphic designer and funnel builder\nImplement funnel optimization by tracking conversion rates and identifying split tests with the greatest revenue impact\nResponsible for R&D, learning and testing latest customer acquisition ideas and strategies to help scale the business bottom line.\nFull understanding of our courses, coaching programs, and be able to communicate with other agencies about them",
    "companyURL": "https://jobrack.eu/employers/2622",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/648b0136e7646.jpg",
    "companyDescription": "Beach Boss Influencers is the fastest growing coaching community for network marketers to learn the latest social media strategies to grow their businesses."
  },
  {
    "jobTitle": "Data Analyst (Growth Analyst)",
    "jobComName": "SUSANCK Inc",
    "jobURL": "https://jobrack.eu/jobs/data-analyst-growth-analyst",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/2373",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/601d65666ab86.jpg",
    "companyDescription": "At SUSANCK Advertising we work with Silicon Valley’s hottest startups to accelerate growth through the next generation of performance marketing. We lead with data and quantitative analysis."
  },
  {
    "jobTitle": "Human Resources Manager",
    "jobComName": "Serve No Master",
    "jobURL": "https://jobrack.eu/jobs/human-resources-manager",
    "jobDescription": "Embodies the values of ownership, accountability, growth orientation, team player, problem solver at heart\nFluent or Native English speaker (written and verbal)\nPeople oriented and results driven\nCompetence to build and effectively manage interpersonal relationships at all levels of the company\nHigh level of organization and ability to prioritize\nAbility to clearly follow instructions\nHard working, self-directed problem solver and quick learner with a positive attitude\nHigh standard of ethics and confidentiality to handle sensitive information\n2+ years of experience working remotely\n2+ years in Human Resources",
    "companyURL": "https://jobrack.eu/employers/1763",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/5d315dd370b76.jpg",
    "companyDescription": "ABOUT US"
  },
  {
    "jobTitle": "Full Stack Developer",
    "jobComName": "CrewFire",
    "jobURL": "https://jobrack.eu/jobs/full-stack-developer",
    "jobDescription": "Good sense of UI and UX\nPrevious experience with React codebase",
    "companyURL": "https://jobrack.eu/employers/2370",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/601d1f5f4a5f4.jpg",
    "companyDescription": ""
  },
  {
    "jobTitle": "Link-building Outreach Coordinator (Marketing Agency)",
    "jobComName": "American SEO Agency",
    "jobURL": "https://jobrack.eu/jobs/link-building-outreach-coordinator-marketing-agency",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/2294",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/5f540d1e8b341.jpg",
    "companyDescription": "Our SEO agency manages SEO campaigns for ecommerce brands in the United States and Europe."
  },
  {
    "jobTitle": "Executive Assistant",
    "jobComName": "American SEO Agency",
    "jobURL": "https://jobrack.eu/jobs/executive-assistant",
    "jobDescription": "Having some experience with SEO\nHaving some experience of video editing",
    "companyURL": "https://jobrack.eu/employers/2294",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/5f540d1e8b341.jpg",
    "companyDescription": ""
  },
  {
    "jobTitle": "Marketing Assistant/Graphic Designer",
    "jobComName": "Oliver Construction Co.",
    "jobURL": "https://jobrack.eu/jobs/marketing-assistant-graphic-designer",
    "jobDescription": "Extensive experience with Adobe InDesign\nProficient in MS Excel\nA solid command of English with reasonable grammar and vocabulary\nCan type fast (at least 55wpm, without typos)\nGive great attention to detail and care deeply about the quality of your work\nAre able to dedicate at least 20 hours a week to our projects (if things go really well, we’ll contract you full-time)\nAre excited to receive a starting salary of $500–$600 USD / month (part-time), with periodic raises (based on merit and performance)\nHave consistent access to a reliable high-speed Internet connection",
    "companyURL": "https://jobrack.eu/employers/2333",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/601b82f095988.jpg",
    "companyDescription": "NOTE: This position is REMOTE. Work from anywhere! PART-TIME to start, but if things go well, FULL-TIME after that."
  },
  {
    "jobTitle": "Sales and Digital Marketing Copywriter",
    "jobComName": "Major Ltd.",
    "jobURL": "https://jobrack.eu/jobs/sales-and-digital-marketing-copywriter",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/2283",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/5f331a97c022e.jpg",
    "companyDescription": "Good day,"
  },
  {
    "jobTitle": "Website designer for local business websites (WIX, Wordpress)",
    "jobComName": "Goodjuju Marketing",
    "jobURL": "https://jobrack.eu/jobs/website-designer-for-local-business-websites-wix-wordpress",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/2372",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/65b549dbc7b88.jpg",
    "companyDescription": "Looking for someone with an eye for modern and stunning local business website design. We build most of our clients websites on WIX for simplicity purposes, but some clients also have Wordpress. We hope to find someone who has experience on different platforms."
  },
  {
    "jobTitle": "Facebook Ads & Google Ads Specialist",
    "jobComName": "Lawn Company",
    "jobURL": "https://jobrack.eu/jobs/facebook-ads-google-ads-specialist",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/2371",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/601aab61e7e21.jpg",
    "companyDescription": "Our team is looking for a Facebook Ads and Google Ads Manager! The ideal candidate has extensive experience in Search and Display Ads via Facebook Ads, and Google Ads with a proven record of delivering success! You will work with our Marketing Manager, and our Graphic Designer to create eye-catching, relevant display ads. Our goal is to leverage Facebook Ads and Google Ads to drive traffic to our Shopify Website to increase conversions and customer retention."
  },
  {
    "jobTitle": "Full Stack Angular and C# Sr. Principal Engineer",
    "jobComName": "Major Ltd.",
    "jobURL": "https://jobrack.eu/jobs/full-stack-angular-and-c-sr-principal-engineer",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/2283",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/5f331a97c022e.jpg",
    "companyDescription": "Good day,"
  },
  {
    "jobTitle": "Mobile App Designer (Slots)",
    "jobComName": "GreenTomatoMedia Limited",
    "jobURL": "https://jobrack.eu/jobs/mobile-app-designer-slots",
    "jobDescription": "Develop intuitive, usable, and engaging interactions and visual designs for mobile.\nProvide strategic thinking and leadership.\nCollaborate with cross-functional teams throughout the design process\nParticipate in the development process from definition, through design, build, test, release, and maintenance.\nResearch and track advancements in mobile application design patterns.\nBreak any design problem down into viable actionable chunks and solve them with clarity and precision.\nStaying in the loop and on top of the latest standards, changes, trends in the mobile design field.",
    "companyURL": "https://jobrack.eu/employers/2193",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6017bde2ce328.jpg",
    "companyDescription": "Are you a great Graphic Designer who wants to take more responsibility in a fast growing company ? You like playing games and are familiar with the slot (casino) world ? If this sounds like you then keep reading…."
  },
  {
    "jobTitle": "Unity developer for slots apps",
    "jobComName": "GreenTomatoMedia Limited",
    "jobURL": "https://jobrack.eu/jobs/unity-developer-for-slots-apps",
    "jobDescription": "Develop some game machines and system processes\nCreate mini games for special events\nImplement and optimize functionality in existing game engines\nDeveloping, troubleshooting, testing codes, fixing bugs and supporting the apps",
    "companyURL": "https://jobrack.eu/employers/2193",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6017bde2ce328.jpg",
    "companyDescription": "Are you a great Unity developer who wants to take more responsibility in a fast growing company ? You like playing games and are familiar with the slot world ? If this sounds like you then keep reading…."
  },
  {
    "jobTitle": "Virtual Assistant for a Company on a Meaningful Mission",
    "jobComName": "Zen Habits",
    "jobURL": "https://jobrack.eu/jobs/virtual-assistant-for-a-company-on-a-meaningful-mission",
    "jobDescription": "Someone who is good at staying on top of things and learning quickly\nSomeone who can take initiative and help get things done\nGood English skills\nComfort with social media, Slack, and technology in general\nAttention to detail\nAbility to take on multiple projects and work to deadlines\nExperience with this kind of work",
    "companyURL": "https://jobrack.eu/employers/2368",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/601835e091168.jpg",
    "companyDescription": "Hi, I'm Leo Babauta, Founder of Zen Habits."
  },
  {
    "jobTitle": "Personal Assistant for Black Winch, the AS A Service Experts",
    "jobComName": "Black Winch",
    "jobURL": "https://jobrack.eu/jobs/personal-assistant-for-black-winch-the-as-a-service-experts",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/2369",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/60183d1591e7c.jpg",
    "companyDescription": "We need you to keep us on track and reach our strategic goals!"
  },
  {
    "jobTitle": "Experienced Graphic Designer for Social Media Agency",
    "jobComName": "Chai Digital",
    "jobURL": "https://jobrack.eu/jobs/experienced-graphic-designer-for-social-media-agency",
    "jobDescription": "Please share a portfolio of your work\nPlease confirm your time zone and if you are comfortable working in multiple time zones\nFamiliarity with design software and technologies (such as Photoshop, Illustrator, Canva, etc.)\nDegree in Design, Fine Arts or related field or at least some course in the area (to show some solid interest in the field)\nAge is only a number. You may be young, but if you have a deep passion for the mission, you could well be perfect for the job.",
    "companyURL": "https://jobrack.eu/employers/2366",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/601663e808ca8.jpg",
    "companyDescription": "Graphic designer: Job Description"
  },
  {
    "jobTitle": "Amazon Advertising Manager",
    "jobComName": "Amazon Advertising Agency",
    "jobURL": "https://jobrack.eu/jobs/amazon-advertising-manager",
    "jobDescription": "Ability to work from home in a remote role\nCompetitive Salary based on experience\nOngoing training and support\nAbility to work as part of team that shares a passion for e-commerce",
    "companyURL": "https://jobrack.eu/employers/2336",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/60130151b48c1.jpg",
    "companyDescription": "Looking for an Amazon advertising manager who loves working with Amazon sellers to help grow their business using Amazon ads. The ideal candidate loves data and spreadsheets, has experience managing ads in seller central, is a strong communicator and works well in a remote team environment and has knowledge about selling on Amazon. Join a fast growing team with opportunity for growth!"
  },
  {
    "jobTitle": "B2B Marketing & Sales Support Staff",
    "jobComName": "KeySmart",
    "jobURL": "https://jobrack.eu/jobs/b2b-marketing-sales-support-staff",
    "jobDescription": "",
    "companyURL": "https://jobrack.eu/employers/2364",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/601371a3a044d.jpg",
    "companyDescription": "This is a role with a 30-hour workweek. You should be able to work 6 hours during 8am\nCST - 4pm CST. We are looking for someone who can start immediately.\n\nOur US-based consumer products company (KeySmart) is looking for a talented individual to\njoin our B2B Sales & Marketing Team.\n\nWe need a motivated, enthusiastic, communicative, and hard-working individual to help\nassist our sales team with customer support, lead generation, and general administrative tasks.\n\nOur ideal candidate would have at least two years of experience in a customer service or sales\nrole, excellent written and verbal English communication skills, a strong work ethic, and would be\nhighly self-motivated. Experience with HubSpot or a similar CRM system will give you a leg up.\nExperience with ZoomInfo is a big plus!\n\nWe will provide training through written and video guides to make the onboarding process\nsimple and seamless.\n\nSome of your main responsibilities would be:\n● Assisting Retail Sales Team by generating lists of leads and executing lead generation\nactivities such as emailing, LinkedIn messages, and calls.\n● Assisting Retail Marketing Team by renaming, tagging, and uploading images to the\nDigital Asset Management software.\n● Working on data entry and administrative tasks to support the Retail Sales Team\nThere will also be opportunities to grow as you take on more responsibility.\n\nRequirements:\n1. Fluent in English\n2. Detail-oriented and self-motivated, can complete a task with little oversight\n3. Experience with lead generation, including cold emailing prospective clients and list building\n4. Skilled with spreadsheets and able to quickly learn new software programs\n5. Comfortable talking on the phone with customers and calmly working through problems"
  },
  {
    "jobTitle": "Data Analyst - Paid Internship - Pharma industry",
    "jobComName": "Probatech",
    "jobURL": "https://jobrack.eu/jobs/data-analyst-paid-internship-pharma-industry",
    "jobDescription": "Learn more about R&D in the pharmaceutical industry\nLearn how to interpret, analyse and report information that can change the fortunes of healthcare innovators\nDiscover new tools and tricks for automation of your research and for project management",
    "companyURL": "https://jobrack.eu/employers/2365",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6012e5c864eb4.jpg",
    "companyDescription": "The Challenge:"
  },
  {
    "jobTitle": "Google Ads Specialist for Marketing Company Needed",
    "jobComName": "Remotivate",
    "jobURL": "https://jobrack.eu/jobs/google-ads-specialist-for-marketing-company-needed",
    "jobDescription": "Planning, developing and executing Google Ads campaigns (Search, Shopping, Display and YouTube) with an emphasis on Shopping Ads.\nManaging 6 – 12 client accounts simultaneously (depending on size)\nMaintaining and improving client performance goals\nAudit Google Ads, Analytics accounts, build product feeds.\nPrepare weekly and monthly reports.\nDevelop insights and plan actions to increase client revenues and ROI.\nCollaborate with our team and the client to plan and run campaign initiatives.\nKeep up to date with the latest from our industry.",
    "companyURL": "https://jobrack.eu/employers/1549",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/5d1e4537dafad.jpg",
    "companyDescription": "Hello Ad Specialists!"
  },
  {
    "jobTitle": "Project Manager for a Product Design Firm",
    "jobComName": "Think Bold Studio",
    "jobURL": "https://jobrack.eu/jobs/project-manager-for-a-product-design-firm",
    "jobDescription": "Meet with the Integrator weekly - report on what we’re working on and what’s coming up\nEnsure projects are delivered on time, and that our clients are getting more than they expect\nHold and run the stand-up meeting with the design team twice a week\nCheck-in with partners where needed (subcontractors, suppliers, etc.)\nHold and run client onboarding meetings, progress check-ins, and offboarding meetings\nStay on top of the billing schedule, issue invoices, and make sure they get paid in a timely manner\nUpdate the team in Slack about what’s our focus for the week and what to expect\nUpdate the customers on the project status, our progress, any potential delays, and other issues\nGather clients’ feedback on how we’re doing as a team, and implement necessary improvements\nDeal with any customer issues and resolve any potential conflicts (this doesn’t happen very often!)",
    "companyURL": "https://jobrack.eu/employers/2363",
    "companyLogoURL": "https://jobrack.eu/user_files/employers/images/6011712a3044b.jpg",
    "companyDescription": "Are you passionate about building systems and running teams in a fully-remote business? Do you love geeking out about growth and efficiency, and constantly trying to improve business process and make things run more smoothly?"
  }
]